Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_2 (InputLayer)             (None, 3, 224, 224)   0                                            
____________________________________________________________________________________________________
conv1/7x7_s2 (Convolution2D)     (None, 64, 112, 112)  9472        input_2[0][0]                    
____________________________________________________________________________________________________
zeropadding2d_5 (ZeroPadding2D)  (None, 64, 114, 114)  0           conv1/7x7_s2[0][0]               
____________________________________________________________________________________________________
poolhelper_5 (PoolHelper)        (None, 64, 114, 114)  0           zeropadding2d_5[0][0]            
____________________________________________________________________________________________________
pool1/3x3_s2 (MaxPooling2D)      (None, 64, 56, 56)    0           poolhelper_5[0][0]               
____________________________________________________________________________________________________
pool1/norm1 (LRN)                (None, 64, 56, 56)    0           pool1/3x3_s2[0][0]               
____________________________________________________________________________________________________
conv2/3x3_reduce (Convolution2D) (None, 64, 56, 56)    4160        pool1/norm1[0][0]                
____________________________________________________________________________________________________
conv2/3x3 (Convolution2D)        (None, 192, 56, 56)   110784      conv2/3x3_reduce[0][0]           
____________________________________________________________________________________________________
conv2/norm2 (LRN)                (None, 192, 56, 56)   0           conv2/3x3[0][0]                  
____________________________________________________________________________________________________
zeropadding2d_6 (ZeroPadding2D)  (None, 192, 58, 58)   0           conv2/norm2[0][0]                
____________________________________________________________________________________________________
poolhelper_6 (PoolHelper)        (None, 192, 58, 58)   0           zeropadding2d_6[0][0]            
____________________________________________________________________________________________________
pool2/3x3_s2 (MaxPooling2D)      (None, 192, 28, 28)   0           poolhelper_6[0][0]               
____________________________________________________________________________________________________
inception_3a/3x3_reduce (Convolu (None, 96, 28, 28)    18528       pool2/3x3_s2[0][0]               
____________________________________________________________________________________________________
inception_3a/5x5_reduce (Convolu (None, 16, 28, 28)    3088        pool2/3x3_s2[0][0]               
____________________________________________________________________________________________________
inception_3a/pool (MaxPooling2D) (None, 192, 28, 28)   0           pool2/3x3_s2[0][0]               
____________________________________________________________________________________________________
inception_3a/1x1 (Convolution2D) (None, 64, 28, 28)    12352       pool2/3x3_s2[0][0]               
____________________________________________________________________________________________________
inception_3a/3x3 (Convolution2D) (None, 128, 28, 28)   110720      inception_3a/3x3_reduce[0][0]    
____________________________________________________________________________________________________
inception_3a/5x5 (Convolution2D) (None, 32, 28, 28)    12832       inception_3a/5x5_reduce[0][0]    
____________________________________________________________________________________________________
inception_3a/pool_proj (Convolut (None, 32, 28, 28)    6176        inception_3a/pool[0][0]          
____________________________________________________________________________________________________
inception_3a/output (Merge)      (None, 256, 28, 28)   0           inception_3a/1x1[0][0]           
                                                                   inception_3a/3x3[0][0]           
                                                                   inception_3a/5x5[0][0]           
                                                                   inception_3a/pool_proj[0][0]     
____________________________________________________________________________________________________
inception_3b/3x3_reduce (Convolu (None, 128, 28, 28)   32896       inception_3a/output[0][0]        
____________________________________________________________________________________________________
inception_3b/5x5_reduce (Convolu (None, 32, 28, 28)    8224        inception_3a/output[0][0]        
____________________________________________________________________________________________________
inception_3b/pool (MaxPooling2D) (None, 256, 28, 28)   0           inception_3a/output[0][0]        
____________________________________________________________________________________________________
inception_3b/1x1 (Convolution2D) (None, 128, 28, 28)   32896       inception_3a/output[0][0]        
____________________________________________________________________________________________________
inception_3b/3x3 (Convolution2D) (None, 192, 28, 28)   221376      inception_3b/3x3_reduce[0][0]    
____________________________________________________________________________________________________
inception_3b/5x5 (Convolution2D) (None, 96, 28, 28)    76896       inception_3b/5x5_reduce[0][0]    
____________________________________________________________________________________________________
inception_3b/pool_proj (Convolut (None, 64, 28, 28)    16448       inception_3b/pool[0][0]          
____________________________________________________________________________________________________
inception_3b/output (Merge)      (None, 480, 28, 28)   0           inception_3b/1x1[0][0]           
                                                                   inception_3b/3x3[0][0]           
                                                                   inception_3b/5x5[0][0]           
                                                                   inception_3b/pool_proj[0][0]     
____________________________________________________________________________________________________
zeropadding2d_7 (ZeroPadding2D)  (None, 480, 30, 30)   0           inception_3b/output[0][0]        
____________________________________________________________________________________________________
poolhelper_7 (PoolHelper)        (None, 480, 30, 30)   0           zeropadding2d_7[0][0]            
____________________________________________________________________________________________________
pool3/3x3_s2 (MaxPooling2D)      (None, 480, 14, 14)   0           poolhelper_7[0][0]               
____________________________________________________________________________________________________
inception_4a/3x3_reduce (Convolu (None, 96, 14, 14)    46176       pool3/3x3_s2[0][0]               
____________________________________________________________________________________________________
inception_4a/5x5_reduce (Convolu (None, 16, 14, 14)    7696        pool3/3x3_s2[0][0]               
____________________________________________________________________________________________________
inception_4a/pool (MaxPooling2D) (None, 480, 14, 14)   0           pool3/3x3_s2[0][0]               
____________________________________________________________________________________________________
inception_4a/1x1 (Convolution2D) (None, 192, 14, 14)   92352       pool3/3x3_s2[0][0]               
____________________________________________________________________________________________________
inception_4a/3x3 (Convolution2D) (None, 208, 14, 14)   179920      inception_4a/3x3_reduce[0][0]    
____________________________________________________________________________________________________
inception_4a/5x5 (Convolution2D) (None, 48, 14, 14)    19248       inception_4a/5x5_reduce[0][0]    
____________________________________________________________________________________________________
inception_4a/pool_proj (Convolut (None, 64, 14, 14)    30784       inception_4a/pool[0][0]          
____________________________________________________________________________________________________
inception_4a/output (Merge)      (None, 512, 14, 14)   0           inception_4a/1x1[0][0]           
                                                                   inception_4a/3x3[0][0]           
                                                                   inception_4a/5x5[0][0]           
                                                                   inception_4a/pool_proj[0][0]     
____________________________________________________________________________________________________
inception_4b/3x3_reduce (Convolu (None, 112, 14, 14)   57456       inception_4a/output[0][0]        
____________________________________________________________________________________________________
inception_4b/5x5_reduce (Convolu (None, 24, 14, 14)    12312       inception_4a/output[0][0]        
____________________________________________________________________________________________________
inception_4b/pool (MaxPooling2D) (None, 512, 14, 14)   0           inception_4a/output[0][0]        
____________________________________________________________________________________________________
inception_4b/1x1 (Convolution2D) (None, 160, 14, 14)   82080       inception_4a/output[0][0]        
____________________________________________________________________________________________________
inception_4b/3x3 (Convolution2D) (None, 224, 14, 14)   226016      inception_4b/3x3_reduce[0][0]    
____________________________________________________________________________________________________
inception_4b/5x5 (Convolution2D) (None, 64, 14, 14)    38464       inception_4b/5x5_reduce[0][0]    
____________________________________________________________________________________________________
inception_4b/pool_proj (Convolut (None, 64, 14, 14)    32832       inception_4b/pool[0][0]          
____________________________________________________________________________________________________
inception_4b_output (Merge)      (None, 512, 14, 14)   0           inception_4b/1x1[0][0]           
                                                                   inception_4b/3x3[0][0]           
                                                                   inception_4b/5x5[0][0]           
                                                                   inception_4b/pool_proj[0][0]     
____________________________________________________________________________________________________
inception_4c/3x3_reduce (Convolu (None, 128, 14, 14)   65664       inception_4b_output[0][0]        
____________________________________________________________________________________________________
inception_4c/5x5_reduce (Convolu (None, 24, 14, 14)    12312       inception_4b_output[0][0]        
____________________________________________________________________________________________________
inception_4c/pool (MaxPooling2D) (None, 512, 14, 14)   0           inception_4b_output[0][0]        
____________________________________________________________________________________________________
inception_4c/1x1 (Convolution2D) (None, 128, 14, 14)   65664       inception_4b_output[0][0]        
____________________________________________________________________________________________________
inception_4c/3x3 (Convolution2D) (None, 256, 14, 14)   295168      inception_4c/3x3_reduce[0][0]    
____________________________________________________________________________________________________
inception_4c/5x5 (Convolution2D) (None, 64, 14, 14)    38464       inception_4c/5x5_reduce[0][0]    
____________________________________________________________________________________________________
inception_4c/pool_proj (Convolut (None, 64, 14, 14)    32832       inception_4c/pool[0][0]          
____________________________________________________________________________________________________
inception_4c/output (Merge)      (None, 512, 14, 14)   0           inception_4c/1x1[0][0]           
                                                                   inception_4c/3x3[0][0]           
                                                                   inception_4c/5x5[0][0]           
                                                                   inception_4c/pool_proj[0][0]     
____________________________________________________________________________________________________
inception_4d/3x3_reduce (Convolu (None, 144, 14, 14)   73872       inception_4c/output[0][0]        
____________________________________________________________________________________________________
inception_4d/5x5_reduce (Convolu (None, 32, 14, 14)    16416       inception_4c/output[0][0]        
____________________________________________________________________________________________________
inception_4d/pool (MaxPooling2D) (None, 512, 14, 14)   0           inception_4c/output[0][0]        
____________________________________________________________________________________________________
inception_4d/1x1 (Convolution2D) (None, 112, 14, 14)   57456       inception_4c/output[0][0]        
____________________________________________________________________________________________________
inception_4d/3x3 (Convolution2D) (None, 288, 14, 14)   373536      inception_4d/3x3_reduce[0][0]    
____________________________________________________________________________________________________
inception_4d/5x5 (Convolution2D) (None, 64, 14, 14)    51264       inception_4d/5x5_reduce[0][0]    
____________________________________________________________________________________________________
inception_4d/pool_proj (Convolut (None, 64, 14, 14)    32832       inception_4d/pool[0][0]          
____________________________________________________________________________________________________
inception_4d/output (Merge)      (None, 528, 14, 14)   0           inception_4d/1x1[0][0]           
                                                                   inception_4d/3x3[0][0]           
                                                                   inception_4d/5x5[0][0]           
                                                                   inception_4d/pool_proj[0][0]     
____________________________________________________________________________________________________
inception_4e/3x3_reduce (Convolu (None, 160, 14, 14)   84640       inception_4d/output[0][0]        
____________________________________________________________________________________________________
inception_4e/5x5_reduce (Convolu (None, 32, 14, 14)    16928       inception_4d/output[0][0]        
____________________________________________________________________________________________________
inception_4e/pool (MaxPooling2D) (None, 528, 14, 14)   0           inception_4d/output[0][0]        
____________________________________________________________________________________________________
inception_4e/1x1 (Convolution2D) (None, 256, 14, 14)   135424      inception_4d/output[0][0]        
____________________________________________________________________________________________________
inception_4e/3x3 (Convolution2D) (None, 320, 14, 14)   461120      inception_4e/3x3_reduce[0][0]    
____________________________________________________________________________________________________
inception_4e/5x5 (Convolution2D) (None, 128, 14, 14)   102528      inception_4e/5x5_reduce[0][0]    
____________________________________________________________________________________________________
inception_4e/pool_proj (Convolut (None, 128, 14, 14)   67712       inception_4e/pool[0][0]          
____________________________________________________________________________________________________
inception_4e/output (Merge)      (None, 832, 14, 14)   0           inception_4e/1x1[0][0]           
                                                                   inception_4e/3x3[0][0]           
                                                                   inception_4e/5x5[0][0]           
                                                                   inception_4e/pool_proj[0][0]     
____________________________________________________________________________________________________
zeropadding2d_8 (ZeroPadding2D)  (None, 832, 16, 16)   0           inception_4e/output[0][0]        
____________________________________________________________________________________________________
poolhelper_8 (PoolHelper)        (None, 832, 16, 16)   0           zeropadding2d_8[0][0]            
____________________________________________________________________________________________________
pool4/3x3_s2 (MaxPooling2D)      (None, 832, 7, 7)     0           poolhelper_8[0][0]               
____________________________________________________________________________________________________
inception_5a/3x3_reduce (Convolu (None, 160, 7, 7)     133280      pool4/3x3_s2[0][0]               
____________________________________________________________________________________________________
inception_5a/5x5_reduce (Convolu (None, 32, 7, 7)      26656       pool4/3x3_s2[0][0]               
____________________________________________________________________________________________________
inception_5a/pool (MaxPooling2D) (None, 832, 7, 7)     0           pool4/3x3_s2[0][0]               
____________________________________________________________________________________________________
inception_5a/1x1 (Convolution2D) (None, 256, 7, 7)     213248      pool4/3x3_s2[0][0]               
____________________________________________________________________________________________________
inception_5a/3x3 (Convolution2D) (None, 320, 7, 7)     461120      inception_5a/3x3_reduce[0][0]    
____________________________________________________________________________________________________
inception_5a/5x5 (Convolution2D) (None, 128, 7, 7)     102528      inception_5a/5x5_reduce[0][0]    
____________________________________________________________________________________________________
inception_5a/pool_proj (Convolut (None, 128, 7, 7)     106624      inception_5a/pool[0][0]          
____________________________________________________________________________________________________
inception_5a/output (Merge)      (None, 832, 7, 7)     0           inception_5a/1x1[0][0]           
                                                                   inception_5a/3x3[0][0]           
                                                                   inception_5a/5x5[0][0]           
                                                                   inception_5a/pool_proj[0][0]     
____________________________________________________________________________________________________
inception_5b/3x3_reduce (Convolu (None, 192, 7, 7)     159936      inception_5a/output[0][0]        
____________________________________________________________________________________________________
inception_5b/5x5_reduce (Convolu (None, 48, 7, 7)      39984       inception_5a/output[0][0]        
____________________________________________________________________________________________________
inception_5b/pool (MaxPooling2D) (None, 832, 7, 7)     0           inception_5a/output[0][0]        
____________________________________________________________________________________________________
loss1/ave_pool (AveragePooling2D (None, 512, 4, 4)     0           inception_4a/output[0][0]        
____________________________________________________________________________________________________
loss2/ave_pool (AveragePooling2D (None, 528, 4, 4)     0           inception_4d/output[0][0]        
____________________________________________________________________________________________________
inception_5b/1x1 (Convolution2D) (None, 384, 7, 7)     319872      inception_5a/output[0][0]        
____________________________________________________________________________________________________
inception_5b/3x3 (Convolution2D) (None, 384, 7, 7)     663936      inception_5b/3x3_reduce[0][0]    
____________________________________________________________________________________________________
inception_5b/5x5 (Convolution2D) (None, 128, 7, 7)     153728      inception_5b/5x5_reduce[0][0]    
____________________________________________________________________________________________________
inception_5b/pool_proj (Convolut (None, 128, 7, 7)     106624      inception_5b/pool[0][0]          
____________________________________________________________________________________________________
loss1/conv (Convolution2D)       (None, 128, 4, 4)     65664       loss1/ave_pool[0][0]             
____________________________________________________________________________________________________
loss2/conv (Convolution2D)       (None, 128, 4, 4)     67712       loss2/ave_pool[0][0]             
____________________________________________________________________________________________________
inception_5b/output (Merge)      (None, 1024, 7, 7)    0           inception_5b/1x1[0][0]           
                                                                   inception_5b/3x3[0][0]           
                                                                   inception_5b/5x5[0][0]           
                                                                   inception_5b/pool_proj[0][0]     
____________________________________________________________________________________________________
flatten_4 (Flatten)              (None, 2048)          0           loss1/conv[0][0]                 
____________________________________________________________________________________________________
flatten_5 (Flatten)              (None, 2048)          0           loss2/conv[0][0]                 
____________________________________________________________________________________________________
pool5/7x7_s2 (AveragePooling2D)  (None, 1024, 1, 1)    0           inception_5b/output[0][0]        
____________________________________________________________________________________________________
loss1/fc (Dense)                 (None, 1024)          2098176     flatten_4[0][0]                  
____________________________________________________________________________________________________
loss2/fc (Dense)                 (None, 1024)          2098176     flatten_5[0][0]                  
____________________________________________________________________________________________________
flatten_6 (Flatten)              (None, 1024)          0           pool5/7x7_s2[0][0]               
____________________________________________________________________________________________________
dropout_4 (Dropout)              (None, 1024)          0           loss1/fc[0][0]                   
____________________________________________________________________________________________________
dropout_5 (Dropout)              (None, 1024)          0           loss2/fc[0][0]                   
____________________________________________________________________________________________________
dropout_6 (Dropout)              (None, 1024)          0           flatten_6[0][0]                  
____________________________________________________________________________________________________
loss1/classifier (Dense)         (None, 1000)          1025000     dropout_4[0][0]                  
____________________________________________________________________________________________________
loss2/classifier (Dense)         (None, 1000)          1025000     dropout_5[0][0]                  
____________________________________________________________________________________________________
loss3/classifier (Dense)         (None, 1000)          1025000     dropout_6[0][0]                  
____________________________________________________________________________________________________
activation_3 (Activation)        (None, 1000)          0           loss1/classifier[0][0]           
____________________________________________________________________________________________________
activation_4 (Activation)        (None, 1000)          0           loss2/classifier[0][0]           
____________________________________________________________________________________________________
prob (Activation)                (None, 1000)          0           loss3/classifier[0][0]           
====================================================================================================
Total params: 13378280
____________________________________________________________________________________________________
